apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
                case 8: // Comando 08: Escribe en la memoria flash la fecha, hora, formato YYYYMMDDHHMMSS
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 08 recibido: Guardar fecha y hora - YYYYMMDDHHMMSS\x1b[0m");

                    if (p_evt->params.rx_data.length >= 19) // 5 de comando + 14 de fecha/hora
                    {
                        // Crear buffer local para garantizar terminador nulo
                        char fecha_buffer[15] = {0}; // 14 caracteres + terminador nulo

                        // Copiar exactamente 14 caracteres de fecha/hora
                        memcpy(fecha_buffer, &message[5], 14);
                        fecha_buffer[14] = '\0'; // Garantizar terminador nulo

                        // Debug: mostrar cadena recibida
                        NRF_LOG_RAW_INFO("\n> Cadena de fecha recibida: '%s' (longitud: %d)",
                                         fecha_buffer, strlen(fecha_buffer));

                        // Crear estructura de fecha local
                        datetime_t dt = {0};

                        // Parsing con validación mejorada
                        int parsed = sscanf(fecha_buffer, "%4hu%2hhu%2hhu%2hhu%2hhu%2hhu",
                                            &dt.year, &dt.month, &dt.day,
                                            &dt.hour, &dt.minute, &dt.second);

                        if (parsed == 6)
                        {
                            // Validación básica de rangos
                            if (dt.year >= 2000 && dt.year <= 2099 &&
                                dt.month >= 1 && dt.month <= 12 &&
                                dt.day >= 1 && dt.day <= 31 &&
                                dt.hour <= 23 && dt.minute <= 59 && dt.second <= 59)
                            {
                                NRF_LOG_RAW_INFO("\n> Fecha parseada correctamente: "
                                                 "%04u-%02u-%02u %02u:%02u:%02u",
                                                 dt.year, dt.month, dt.day,
                                                 dt.hour, dt.minute, dt.second);

                                // Guardar en flash
                                err_code = write_date_to_flash(&dt);

                                if (err_code == NRF_SUCCESS)
                                {
                                    NRF_LOG_RAW_INFO("\n\x1b[1;32m> Fecha guardada exitosamente en flash\x1b[0m");
                                }
                                else
                                {
                                    NRF_LOG_ERROR("\n\x1b[1;31m> Error guardando fecha: 0x%X\x1b[0m", err_code);
                                }
                            }
                            else
                            {
                                NRF_LOG_WARNING("\n\x1b[1;33m> Valores de fecha fuera de rango\x1b[0m");
                                NRF_LOG_RAW_INFO("\n  Ano: %u, Mes: %u, Dia: %u", dt.year, dt.month, dt.day);
                                NRF_LOG_RAW_INFO("\n  Hora: %u, Min: %u, Seg: %u", dt.hour, dt.minute, dt.second);
                            }
                        }
                        else
                        {
                            NRF_LOG_WARNING("\n\x1b[1;33m> Error en parsing. Elementos parseados: %d/6\x1b[0m", parsed);
                            NRF_LOG_RAW_INFO("\n> Formato esperado: YYYYMMDDHHMMSS");
                            NRF_LOG_RAW_INFO("\n> Ejemplo: 20250804143025 (2025-08-04 14:30:25)");
                        }
                    }
                    else
                    {
                        NRF_LOG_WARNING("\n\x1b[1;33m> Datos insuficientes. Longitud recibida: %d, esperada: 19+\x1b[0m",
                                        p_evt->params.rx_data.length);
                        NRF_LOG_RAW_INFO("\n> Formato: 11108YYYYMMDDHHMMSS");
                    }
                    break;
                }

                case 9: // Comando 09: Leer fecha y hora almacenada en flash
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 09 recibido: Leer fecha y hora\x1b[0m");

                    datetime_t dt = read_date_from_flash();

                    NRF_LOG_RAW_INFO(
                        "\n>> Fecha almacenada: %04u-%02u-%02u %02u:%02u:%02u", dt.year,
                        dt.month, dt.day, dt.hour, dt.minute, dt.second);

                    break;
                }

                case 10: // Guarda en la memoria el tiempo de encendido extendido
                {
                    if (p_evt->params.rx_data.length >= 6)
                    {
                        char     time_str[4] = {message[5], message[6], message[7], '\0'};
                        uint32_t time_in_seconds_extended __attribute__((aligned(4))) =
                            atoi(time_str) * 1000;
                        if (time_in_seconds_extended <= 666000)
                        {
                            NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 10 recibido: "
                                             "Cambiar tiempo de encendido extendido\x1b[0m");
                            write_time_to_flash(TIEMPO_ENCENDIDO_EXTENDED, time_in_seconds_extended);
                        }
                        else
                        {
                            NRF_LOG_RAW_INFO("\nEl tiempo de encendido extendido excede el maximo "
                                             "permitido (666 segundos).");
                        }
                    }
                    else
                    {
                        NRF_LOG_RAW_INFO("\nComando 10 recibido con datos insuficientes.");
                    }
                    break;
                }
                case 11: // Solicitar tiempo de encendido extendido
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 11 recibido: Solicitar tiempo de encendido extendido\x1b[0m");
                    uint32_t encendido_extendido_ms = read_time_from_flash(
                        TIEMPO_ENCENDIDO_EXTENDED, DEFAULT_DEVICE_ON_TIME_EXTENDED_MS);
                    NRF_LOG_RAW_INFO("\n> Tiempo de encendido extendido configurado: %lu segundos",
                                     encendido_extendido_ms / 1000);

                    break;
                }
                case 12: // Solicitar un registro de historial por ID
                {
                    NRF_LOG_RAW_INFO("\n\n\x1b[1;36m--- Comando 12 recibido: Solicitar registro de historial por ID\x1b[0m");
                    if (p_evt->params.rx_data.length > 5) // Verifica que haya datos suficientes
                    {
                        // Extrae el ID del registro como string (todo lo que sigue después de "11112")
                        size_t id_len    = p_evt->params.rx_data.length - 5;
                        char   id_str[8] = {0}; // Soporta hasta 7 dígitos, ajusta si necesitas más
                        if (id_len < sizeof(id_str))
                        {
                            memcpy(id_str, &message[5], id_len);
                            id_str[id_len]       = '\0';
                            uint16_t registro_id = (uint16_t)atoi(id_str);

                            // Llama a la función para solicitar el registro por ID
                            store_history registro_historial;
                            err_code = read_history_record_by_id(registro_id, &registro_historial);
                            if (err_code == NRF_SUCCESS)
                            {
                                NRF_LOG_RAW_INFO("\nRegistro %u leido correctamente, enviando por NUS...", registro_id);

                                // Preparar array de datos en formato hex (igual que send_all_history)
                                uint8_t  data_array[244];
                                uint16_t position = 0;

                                // Byte 0: Magic
                                data_array[position++] = 0x08;

